#Generated by Fabric Compiler ( version 2022.2-SP1-Lite <build 132640> ) at Sun Oct  1 15:57:55 2023

add_design E:/NIEZS/FPGAdocuments/magicbox1.1/prj/magicbox/ipcore/ddr3_test/ddr3_test.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module i2c_com
remove_design E:/NIEZS/FPGAdocuments/magicbox1.1/prj/magicbox/ipcore/ddr3_test/ddr3_test.idf
add_design "E:/NIEZS/FPGAdocuments/magicbox1.1/prj/magicbox/source/reg_config.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.1/prj/magicbox/source/cmos_8b_to_16b.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module iic_dri
add_simulation "E:/NIEZS/FPGAdocuments/magicbox1.1/prj/magicbox/source/tb_8b_to_16b.v"
remove_simulation -force "E:/NIEZS/FPGAdocuments/magicbox1.1/prj/magicbox/source/tb_8b_to_16b.v"
add_simulation "E:/NIEZS/FPGAdocuments/magicbox1.1/prj/magicbox/source/tb/tb_8to16.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module iic_dri
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module iic_dri
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module cmos_8_16bit
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/camera_alg.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/figure_alg.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/camera_alg.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/ram12_GS_controller.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/ram12_GS_controller.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/ram12_GS_controller.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/GrayScaler.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/tb_Grayscalar.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module cmos_8_16bit
add_simulation "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/tb/tb_grayscaler.v"
remove_simulation -force "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/tb/tb_8to16.v"
add_simulation "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/tb/tb_8_16.v"
synthesize -ads -selected_syn_tool_opt 2 
remove_simulation -force "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/tb/tb_grayscaler.v"
add_simulation "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/tb/tb_grayscaler.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/tb_Grayscalar.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module cmos_8_16bit
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/i2c_dri.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/i2c_dri.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/i2c_dri.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module cmos_8_16bit
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/iic_dri.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/ms7200_ctl.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/ms7210_ctl.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/top.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/ms72xx_ctl.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/fram_buf.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/rd_buf.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/rd_ctrl.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/rd_buf.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/sync_vg.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/wr_buf.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/wr_cmd_trans.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/wr_ctrl.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/wr_rd_ctrl_top.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/rd_buf.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/rd_buf.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/sync_vg.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/wr_buf.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/wr_cmd_trans.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/wr_ctrl.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/wr_rd_ctrl_top.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/source/rtl/rd_buf.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/rd_buf.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/rd_ctrl.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/rd_buf.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/sync_vg.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/wr_buf.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/wr_cmd_trans.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/wr_ctrl.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/wr_rd_ctrl_top.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/rd_ctrl.v"
add_design E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/ipcore/u_pll/u_pll.idf
remove_design -force E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/ipcore/u_pll/u_pll.idf
add_design E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/ipcore/u_pll/u_pll.idf
remove_design -force E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/ipcore/u_pll/u_pll.idf
add_design E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/ipcore/pll/pll.idf
remove_design -force E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/ipcore/pll/pll.idf
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/DDR3_50H/DDR3_50H.idf"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/pll/pll.idf"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/rd_fram_buf/rd_fram_buf.idf"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/wr_fram_buf/wr_fram_buf.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module cmos_8_16bit
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module cmos_8_16bit
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/top.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module cmos_8_16bit
synthesize -ads -selected_syn_tool_opt 2 
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/reg_config.v"
remove_design -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/cmos_8b_to_16b.v"
remove_design -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/figure_alg.v"
remove_design -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/GrayScaler.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/cmos_8b_to_16b.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/figure_alg.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/GrayScaler.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/reg_config.v"
remove_constraint -force -logic -fdc "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/top.fdc"
add_constraint "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/top.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/mytop.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.2/prj/magicbox/source/rtl/mytop.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/i2c_com.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/power_on_delay.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/i2c_dri.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/ms7200_ctl.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/ms7210_ctl.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/rd_buf.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/ms72xx_ctl.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/fram_buf.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/sync_vg.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/wr_buf.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/wr_cmd_trans.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/wr_ctrl.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/wr_rd_ctrl_top.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/rd_ctrl.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/cmos_8b_to_16b.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/figure_alg.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/reg_config.v"
remove_design -force E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/DDR3_50H/DDR3_50H.idf
remove_design -force E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/rd_fram_buf/rd_fram_buf.idf
remove_design -force E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/wr_fram_buf/wr_fram_buf.idf
remove_simulation -force "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/tb/tb_8_16.v"
remove_simulation -force "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/tb/tb_power_on_delay.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Grayscaler
remove_constraint -force -logic -fdc "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/top.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Grayscaler
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module grayscaler
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module grayscaler
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ram12_GS_controller
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/GrayScaler.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/grayscaler.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ram12_GS_controller
add_design E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/ipcore/FIFO_cam2gray/FIFO_cam2gray.idf
synthesize -ads -selected_syn_tool_opt 2 
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/gray.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/top.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/sync_vg.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/gray.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module sync_vg
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module sync_vg
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/top.fdc"
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module sync_vg
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/cmos_8b_to_16b.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/i2c_com.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/i2c_dri.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/ms72xx_ctl.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/ms7200_ctl.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/ms7210_ctl.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/power_on_delay.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/reg_config.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
remove_constraint -force -logic -fdc "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/top.fdc"
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
add_constraint "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/top.fdc"
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/top.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/sync_vg.v"
remove_design -force E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/ipcore/FIFO_cam2gray/FIFO_cam2gray.idf
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/top.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/sync_vg.v"
remove_design E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/ipcore/FIFO_cam2gray/FIFO_cam2gray.idf
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/top/top.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/axi_wr_ctrl.v"
remove_constraint -force -logic -fdc "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/top.fdc"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/cmos_8b_to_16b.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/cmos_8_16bit.v"
remove_design -force -verilog "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/top/top.v"
add_design "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/top.v"
set_global_include E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/top.v true
set_global_include E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/rtl/top.v false
add_simulation "E:/NIEZS/FPGAdocuments/magicbox1.3/prj/magicbox/source/tb/tb_axi_wr_ctrl.v"
